_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, None, None, 1)     0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, None, None, 16)    272       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, None, None, 32)    8224      
_________________________________________________________________
dropout_1 (Dropout)          (None, None, None, 32)    0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, None, None, 64)    32832     
_________________________________________________________________
dropout_2 (Dropout)          (None, None, None, 64)    0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, None, None, 512)   33280     
_________________________________________________________________
global_max_pooling2d_1 (Glob (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                5130      
=================================================================
Total params: 79,738.0
Trainable params: 79,738.0
Non-trainable params: 0.0
_________________________________________________________________
